# GetEnumerator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Definitions..::..GetEnumerator Method
Definitions Class See Also
---
Retrieves an enumerator to the collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IEnumerator<Definition> GetEnumerator()
```

Visual Basic
---
```text
Public Overridable Function GetEnumerator As IEnumerator(Of Definition)
```

Visual C++
---
```text
public:
virtual IEnumerator<Definition^>^ GetEnumerator()
```

# ### Return Value
The enumerator.
# ### Implements
IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()
# See Also
Definitions Class
Autodesk.Revit.DB Namespace